{
    "ledger": {
        "request_data_response_ws": {
            "invalidParams": "One or more fields are specified incorrectly, or one or more required fields are missing.",
            "lgrNotFound": "The ledger specified by the ledger_hash or ledger_index does not exist, or it does exist but the server does not have it.",
            "actNotFound": "The Address specified in the account field of the request does not correspond to an account in the ledger."
        }
    },
    "xapp": {
        "headers": {
            "portfolio_balance": "Balance Portfolio",
            "totals": "Totals:",
            "total_value": "Total value:",
            "account_address": "Account address:",
            "explain_value": "Explain Value",
            "info_value": "Value calculation"
        },
        "body": {
            "info_value": "The price for each asset is calculated using the Decentralized Exchange (DEX) and AMM (Automated Market Maker) on the XRP ledger, and just the Decentralized Exchange on Xahau. It calculates the value of an asset by takiing the last trade price times the amount of tokens you hold."
        },
        "button": {
            "try_again": "Try again",
            "account_not_found_login_button": "Login (actNotFound)",
            "close": "Close"
        },
        "error": {
            "modal_title": "Oops",
            "get_ott_data": "Failed to fetch your Xaman data",
            "subscribe_to_account": "Failed to subscribe to the Ledger",
            "sign_offer_create": "A wild error occured creating an Offer",
            "signin": "A wild error occured trying to login",
            "get_offer_data": "A wild error occured trying to get your Offer data",
            "get_curated_assets": "Currency list is not available from the API",
            "get_exchange_rate": "Exchange rates are not available",
            "react_native_webview": "There is an error with the webview",
            "trustline_count": "This xApp is not optimised for accounts with a lot of Trust Lines. Your account has more Trust Lines than what this xApp has been developed for to work with. This is not a problem for your account. This is not a security risk. We will look to optimise this xApp for more TrustLines in the future."
        }
    }
}